cf/src/InformationRegisters/СервисПечатиИстория/СервисПечатиИстория.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СервисПечатиИстория</name>
  <resources>
    <name>ДатаСобытия</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ОписаниеСобытия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Ошибка</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Принтер</name>
    <type>
      <types>CatalogRef.Принтеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСобытия</name>
    <type>
      <types>EnumRef.МетодыСервераПечати</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачалоЧаса</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Разделитель</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

cf/src/InformationRegisters/СервисПечатиИстория/ManagerModule.bsl
// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс


// Зарегистрировать событие взаимодействия с сервером печати.
// 
// Параметры:
// Метод - ПеречислениеСсылка.МетодыСервераПечати
// Результат - Соответствие из КлючИЗначение:
//	* Ключ - Число - Индекс в массиве принтеров по которому производится идентификация последовательности
//  * Значение - Соответствие из КлючИЗначение - Описание события печати
//	  * Ключ - Строка - Наименование параметра с сервера печати
//	  * Значение - Строка, Массив из Строка - Значение параметра с сервера печати
// Принтеры - Массив Из СправочникСсылка.Принтеры - Массив принтеров как он был передан в запросе службе печати
Процедура ЗарегистрироватьСобытие(Метод, Результат, Принтеры) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	ТекущаяДата = ТекущаяДатаСеанса();
	ТекущаяДатаНачалоЧаса = НачалоЧаса(ТекущаяДата);
	Индекс = 0;
	Для Каждого Принтер Из Принтеры Цикл
		
		ЭтоОшибка = Ложь;
		Если Результат[Индекс]["printer-state"] = 0 Тогда
			ЭтоОшибка = Истина;
		КонецЕсли;
		
		Запись = НаборЗаписей.Добавить();
		Запись.Принтер = Принтер;
		Запись.ТипСобытия = Метод;
		Запись.Разделитель = Новый УникальныйИдентификатор();
		Запись.ДатаНачалоЧаса = ТекущаяДатаНачалоЧаса;
					
		Запись.ДатаСобытия = ТекущаяДата;
		Запись.ОписаниеСобытия = СервисПечатиСервер.JSONEncode(Результат[Индекс]);
		Запись.Ошибка = ЭтоОшибка;
		Индекс = Индекс + 1;	
	КонецЦикла;
	
	НаборЗаписей.Записать(Ложь);
			
КонецПроцедуры

Процедура ОчиститьРегистр() Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#КонецЕсли
